Revit 2027 API
FabricArea.FabricAreaType Property
 The type of the Fabric Area.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricAreaType FabricAreaType { get; }
Public ReadOnly Property FabricAreaType As FabricAreaType
	Get
public:
property FabricAreaType^ FabricAreaType {
	FabricAreaType^ get ();
}
member FabricAreaType : FabricAreaType with get
Property Value
FabricAreaType
See Also
Reference
FabricArea Class
Autodesk.Revit.DB.Structure Namespace